/* */

parse arg name

address "SC_SE"
'OW "'name'.html\n"'

'SR "structs/aobject\n" "classes/object\n" "n"'
'SR "structs/amessage.html\n" "methods/index.html#amessage\n" "n"'

'PM "S"'
